# <font color=greenyellow> Continued....

In [1]:
import pandas as pd
import numpy as np

In [7]:
d=pd.DataFrame({'Days':[1,2,3,4,5,6],'Places':['Puri','Konark','Delhi',np.NaN,'Vizag','Goa'],'Visitors':[6500,4800,8000,4600,7300,6000]})
d

   Days  Places  Visitors
0     1    Puri      6500
1     2  Konark      4800
2     3   Delhi      8000
3     4     NaN      4600
4     5   Vizag      7300
5     6     Goa      6000

In [15]:
#NaN implies the place is not remembered but other info regarding it is known

In [16]:
# Checks missing values
d.isnull()
# Whenever null value is found , it gives 'True'

    Days  Places  Visitors
0  False   False     False
1  False   False     False
2  False   False     False
3  False    True     False
4  False   False     False
5  False   False     False

In [7]:
# Jaha pe ek 'True ' milega usko 1 count krega aur last ko total null values count krke dega
d.isnull().sum()

Days        0
Places      1
Visitors    0
dtype: int64

In [9]:
d.info()
#gives entire info about a DataFrame
#Its an attribute of the DataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Days      6 non-null      int64
 1   Places    5 non-null      object
 2   Visitors  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 276.0+ bytes

fillna: wahi fill hoga jaha value NaN hoga

replace: se kuchh b value replce kr saktein hain

In [11]:
# To fill the null values
# fillna= fill not a no. 
d.Places.fillna('Puri')

0      Puri
1    Konark
2     Delhi
3      Puri
4     Vizag
5       Goa
Name: Places, dtype: object

In [12]:
d

   Days  Places  Visitors
0     1    Puri      6500
1     2  Konark      4800
2     3   Delhi      8000
3     4     NaN      4600
4     5   Vizag      7300
5     6     Goa      6000

In [11]:
d.Places.fillna('Puri',inplace=True)

In [12]:
d

   Days  Places  Visitors
0     1    Puri      6500
1     2  Konark      4800
2     3   Delhi      8000
3     4    Puri      4600
4     5   Vizag      7300
5     6     Goa      6000

In [13]:
import warnings
warnings.filterwarnings('ignore')

In [ ]:
#d=d.replce(np.NaN,'Puri')
# If we run it now it will give error as changes have been made already

fillna: only changes the NaN values

replace: can replace any valuez

In [15]:
d.Visitors.replace(4600,5000,inplace=True)
d

   Days  Places  Visitors
0     1    Puri      6500
1     2  Konark      4800
2     3   Delhi      8000
3     4    Puri      5000
4     5   Vizag      7300
5     6     Goa      6000

In [16]:
d.Places.unique() # Unique mtlb koi repeated values nhi honge

array(['Puri', 'Konark', 'Delhi', 'Vizag', 'Goa'], dtype=object)

In [17]:
d.Visitors.mean()# avg value of visitors

6266.666666666667

In [18]:
d.max()

Days            6
Places      Vizag
Visitors     8000
dtype: object

In [19]:
# if Nan is there , it gives float data type
# Float / string data type gives error

In [20]:
d.describe() # gives all the summerized values

           Days     Visitors
count  6.000000     6.000000
mean   3.500000  6266.666667
std    1.870829  1261.216344
min    1.000000  4800.000000
25%    2.250000  5250.000000
50%    3.500000  6250.000000
75%    4.750000  7100.000000
max    6.000000  8000.000000

In [25]:
# Place is a str data type toh uska avg , wagera calc nhi kiya ja sakta hai 
# yaha pe sirf integer type mei describe hoga
# top : maxm tym repeat hua hai jo data 
# freq : top data kitni baar repeat hua hoga
# Agar koi repeatition nhi hai toh Top mei i.e jo value 1st dikhaya hoga wahi top value ke hisab se show hoga

In [23]:
d.describe(include='all')# agar humko str / object ka bhi data chie then hum ese o/p pa enge

            Days Places     Visitors
count   6.000000      6     6.000000
unique       NaN      5          NaN
top          NaN   Puri          NaN
freq         NaN      2          NaN
mean    3.500000    NaN  6266.666667
std     1.870829    NaN  1261.216344
min     1.000000    NaN  4800.000000
25%     2.250000    NaN  5250.000000
50%     3.500000    NaN  6250.000000
75%     4.750000    NaN  7100.000000
max     6.000000    NaN  8000.000000

In [26]:
d.describe(include='O') # sirf object data type ka describe vlaues print krke dega

       Places
count       6
unique      5
top      Puri
freq        2

In [ ]:
# Agar koi bhi column name mei space hoga toh usko access krne ke lie dikkat na ho isilie usko likha jata hai as:
#S['Stu name']

 There are 2 sites to get random data sets:

    1.UCI Machine Learning Repository(No Login)
    2.Kaggle (Register)